tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"

# Common stuf
brew "bash"
brew "fzf"
brew "git"
brew "httpie"
brew "hub"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "zsh"

# asdf specific
brew "automake"
brew "coreutils"
brew "gnupg"
brew "pkg-config"
brew "libtool"
brew "libxslt"
brew "unixodbc"
brew "wxmac"

# casks
cask "atom"
cask "cyberduck"
cask "dash"
cask "dashlane"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "karabiner-elements"
cask "macvim"
cask "onyx"
cask "simplenote"
cask "slack"
cask "spotify"
