tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "universal-ctags/universal-ctags"

## Common stuf
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Statistics utility to count lines of code
brew "cloc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# ctags-compatible tag generator for Go.
brew "gotags"
# GPG - GNU Pretty Good Privacy (PGP) package
brew "gpg"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Git hub command line tool
brew "hub"
# Java...
brew "java" unless system "/usr/libexec/java_home --failfast"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Code-search similar to ack
brew "ripgrep"
# Symlinks farm management
brew "stow"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Vi 'workalike' with many additional features
brew "vim"
# UNIX shell (command interpreter)
brew "zsh"

## asdf specific
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
brew "coreutils"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generic library support script
brew "libtool"
# C XSLT library for GNOME
brew "libxslt"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Cross-platform C++ GUI toolkit (wxWidgets for macOS)
brew "wxmac"
# ASDF
brew "asdf"

## Casks
cask "alacritty"
cask "cyberduck"
cask "dash"
cask "docker"
cask "google-chrome"
cask "karabiner-elements"
# cask "macvim"
cask "onyx"
cask "simplenote"
cask "slack"
cask "spotify"
cask "rectangle"
